ddB0515/bsp_epdInky_r2/examples/idf_epd_raw/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# This board carries rev v1.0 silicon. IDF 6.0 defaults the minimum to v3.01,
# which produces a bootloader the chip refuses to run. The REV_MIN_100 choice
# is gated behind SELECTS_REV_LESS_V3, so both are needed.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM is not optional here. A 1872x1404 panel at 4bpp needs 1.3 MB for the
# current plane and the same again for the previous one, which FastEPD keeps so
# it can work out what actually changed.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_FREERTOS_HZ=1000

# The demo embeds a full-panel 4bpp image (1.3 MB), which overflows the
# default 1 MB app partition.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
